2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC042-PartnerschapBuitenland_request_template-042-PB.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
   <soapenv:Body>
      <brp:bhg_hgpRegistreerHuwelijkGeregistreerdPartnerschap xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsH1}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsH1}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sHB1}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="id.parameters1">
            <brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pHB1}</brp:verwerkingswijze>
         </brp:parameters>
         <brp:aangaanGeregistreerdPartnerschapInBuitenland
                                                  brp:communicatieID="id.aangaanGeregistreerdPIB1"
                                                  brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_rHB1}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rHB1}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding1" brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding1|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
            </brp:gedeblokkeerdeMelding>
			   <brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding2" brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding2|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggr2}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr2}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
				   <brp:document brp:communicatieID="Document1" brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbr1}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbr1}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbr1}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbr1}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieAanvangHuwelijkGeregistreerdPartnerschap brp:communicatieID="id.registratieAanvangHuwelijkPartne1"
                                                           brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument1"
								  brp:referentieID="${DataSource Values#refid.brondocument1}"
								  brp:objecttype="ActieBron">
							</brp:bron>
                  </brp:bronnen>
                  <brp:geregistreerdPartnerschap brp:communicatieID="id.geregistreerdPartnerschap1" brp:objecttype="Relatie">
                     <brp:relatie brp:communicatieID="id.relatie1">
                        <brp:datumAanvang>${DataSource Values#datumAanvang_rgr1}</brp:datumAanvang>
                        <brp:buitenlandsePlaatsAanvang>${DataSource Values#buitenlandsePlaatsAanvang_rgr1}</brp:buitenlandsePlaatsAanvang>
                        <brp:buitenlandseRegioAanvang>${DataSource Values#buitenlandseRegioAanvang_rgr1}</brp:buitenlandseRegioAanvang>
                        <brp:omschrijvingLocatieAanvang>${DataSource Values#omschrijvingLocatieAanvang_rgr1}</brp:omschrijvingLocatieAanvang>
                        <brp:landGebiedAanvangCode>${DataSource Values#landGebiedAanvangCode_rgr1}</brp:landGebiedAanvangCode>
                     </brp:relatie>
                     <brp:betrokkenheden>
                        <brp:partner brp:communicatieID="id.partner1" brp:objecttype="Betrokkenheid">
                           <brp:persoon brp:communicatieID="id.persoon1" brp:objecttype="Persoon"
                                        brp:objectSleutel="${DataSource Values#|objectid.persoon1|}">
                              <brp:identificatienummers brp:communicatieID="id.identificatienummers1" brp:objectSleutel="?">
                                 <brp:administratienummer>${DataSource Values#administratienummer_ipp1}</brp:administratienummer>
                              </brp:identificatienummers>
                              <brp:samengesteldeNaam brp:communicatieID="id.samengesteldeNaam1">
                                 <brp:indicatieNamenreeks>${DataSource Values#indicatieNamenreeks_spp1}</brp:indicatieNamenreeks>
                                 <brp:predicaatCode>${DataSource Values#predicaatCode_spp1}</brp:predicaatCode>
                                 <brp:voornamen>${DataSource Values#voornamen_spp1}</brp:voornamen>
                                 <brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp1}</brp:adellijkeTitelCode>
                                 <brp:voorvoegsel>${DataSource Values#voorvoegsel_spp1}</brp:voorvoegsel>
                                 <brp:scheidingsteken>${DataSource Values#scheidingsteken_spp1}</brp:scheidingsteken>
                                 <brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_spp1}</brp:geslachtsnaamstam>
                              </brp:samengesteldeNaam>
                              <brp:geboorte brp:communicatieID="id.geboorte1">
                                 <brp:datum>${DataSource Values#datum_gpp1}</brp:datum>
                                 <brp:gemeenteCode>${DataSource Values#gemeenteCode_gpp1}</brp:gemeenteCode>
                                 <brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_gpp1}</brp:woonplaatsnaam>
                                 <brp:buitenlandsePlaats>${DataSource Values#buitenlandsePlaats_gpp1}</brp:buitenlandsePlaats>
                                 <brp:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp1}</brp:buitenlandseRegio>
                                 <brp:omschrijvingLocatie>${DataSource Values#omschrijvingLocatie_gpp1}</brp:omschrijvingLocatie>
                                 <brp:landGebiedCode>${DataSource Values#landGebiedCode_gpp1}</brp:landGebiedCode>
                              </brp:geboorte>
                              <brp:geslachtsaanduiding brp:communicatieID="id.geslachtsaanduiding1">
                                 <brp:code>${DataSource Values#code_gpp1}</brp:code>
                              </brp:geslachtsaanduiding>
                              <brp:geslachtsnaamcomponenten>
                                 <brp:geslachtsnaamcomponent brp:communicatieID="id.geslachtsnaamcomponent1"
                                                             brp:objecttype="PersoonGeslachtsnaamcomponent">
                                    <brp:predicaatCode>${DataSource Values#predicaatCode_ggp1}</brp:predicaatCode>
                                    <brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_ggp1}</brp:adellijkeTitelCode>
                                    <brp:voorvoegsel>${DataSource Values#voorvoegsel_ggp1}</brp:voorvoegsel>
                                    <brp:scheidingsteken>${DataSource Values#scheidingsteken_ggp1}</brp:scheidingsteken>
                                    <brp:stam>${DataSource Values#naam_ggp1}</brp:stam>
                                 </brp:geslachtsnaamcomponent>
                              </brp:geslachtsnaamcomponenten>
                           </brp:persoon>
                        </brp:partner>
                        <brp:partner brp:communicatieID="id.partner2" brp:objecttype="Betrokkenheid">
                           <brp:persoon brp:communicatieID="id.persoon2" brp:objecttype="Persoon"
                                        brp:objectSleutel="${DataSource Values#|objectid.persoon2|}">
                              <brp:identificatienummers brp:communicatieID="id.identificatienummers2" brp:objectSleutel="?">
                                 <brp:administratienummer>${DataSource Values#administratienummer_ipp2}</brp:administratienummer>
                              </brp:identificatienummers>
                              <brp:samengesteldeNaam brp:communicatieID="id.samengesteldeNaam2">
                                 <brp:indicatieNamenreeks>${DataSource Values#indicatieNamenreeks_spp2}</brp:indicatieNamenreeks>
                                 <brp:predicaatCode>${DataSource Values#predicaatCode_spp2}</brp:predicaatCode>
                                 <brp:voornamen>${DataSource Values#voornamen_spp2}</brp:voornamen>
                                 <brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp2}</brp:adellijkeTitelCode>
                                 <brp:voorvoegsel>${DataSource Values#voorvoegsel_spp2}</brp:voorvoegsel>
                                 <brp:scheidingsteken>${DataSource Values#scheidingsteken_spp2}</brp:scheidingsteken>
                                 <brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_spp2}</brp:geslachtsnaamstam>
                              </brp:samengesteldeNaam>
                              <brp:geboorte brp:communicatieID="id.geboorte2">
                                 <brp:datum>${DataSource Values#datum_gpp2}</brp:datum>
                                 <brp:gemeenteCode>${DataSource Values#gemeenteCode_gpp2}</brp:gemeenteCode>
                                 <brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_gpp2}</brp:woonplaatsnaam>
                                 <brp:buitenlandsePlaats>${DataSource Values#buitenlandsePlaats_gpp2}</brp:buitenlandsePlaats>
                                 <brp:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp2}</brp:buitenlandseRegio>
                                 <brp:omschrijvingLocatie>${DataSource Values#omschrijvingLocatie_gpp2}</brp:omschrijvingLocatie>
                                 <brp:landGebiedCode>${DataSource Values#landGebiedCode_gpp2}</brp:landGebiedCode>
                              </brp:geboorte>
                              <brp:geslachtsaanduiding brp:communicatieID="id.geslachtsaanduiding2">
                                 <brp:code>${DataSource Values#code_gpp2}</brp:code>
                              </brp:geslachtsaanduiding>
                              <brp:geslachtsnaamcomponenten>
                                 <brp:geslachtsnaamcomponent brp:communicatieID="id.geslachtsnaamcomponent2"
                                                             brp:objecttype="PersoonGeslachtsnaamcomponent">
                                    <brp:predicaatCode>${DataSource Values#predicaatCode_ggp2}</brp:predicaatCode>
                                    <brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_ggp2}</brp:adellijkeTitelCode>
                                    <brp:voorvoegsel>${DataSource Values#voorvoegsel_ggp2}</brp:voorvoegsel>
                                    <brp:scheidingsteken>${DataSource Values#scheidingsteken_ggp2}</brp:scheidingsteken>
                                    <brp:stam>${DataSource Values#naam_ggp2}</brp:stam>
                                 </brp:geslachtsnaamcomponent>
                              </brp:geslachtsnaamcomponenten>
                           </brp:persoon>
                        </brp:partner>
                     </brp:betrokkenheden>
                  </brp:geregistreerdPartnerschap>
               </brp:registratieAanvangHuwelijkGeregistreerdPartnerschap>
               <brp:registratieNaamgebruik brp:communicatieID="id.registratieNaamgebruik1" brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar2}</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument2"
								  brp:referentieID="${DataSource Values#refid.brondocument2}"
								  brp:objecttype="ActieBron">
							</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="id.persoon3" brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#|objectid.persoon3|}">
                     <brp:naamgebruik brp:communicatieID="id.naamgebruik1">
                        <brp:code>${DataSource Values#code_apr1}</brp:code>
                                                <brp:indicatieAfgeleid>${DataSource Values#indicatieAfgeleid_apr1}</brp:indicatieAfgeleid>
                        <brp:predicaatCode>${DataSource Values#predicaatCode_apr1}</brp:predicaatCode>
                        <brp:voornamen>${DataSource Values#voornamen_apr1}</brp:voornamen>
                        <brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_apr1}</brp:adellijkeTitelCode>
                        <brp:voorvoegsel>${DataSource Values#voorvoegsel_apr1}</brp:voorvoegsel>
                        <brp:scheidingsteken>${DataSource Values#scheidingsteken_apr1}</brp:scheidingsteken>
                        <brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_apr1}</brp:geslachtsnaamstam>
                     </brp:naamgebruik>
                  </brp:persoon>
               </brp:registratieNaamgebruik>
            </brp:acties>
         </brp:aangaanGeregistreerdPartnerschapInBuitenland>
      </brp:bhg_hgpRegistreerHuwelijkGeregistreerdPartnerschap>
   </soapenv:Body>
</soapenv:Envelope>
